Lxkgit/blog-3.0/device/stm32/stm32f103c8t6/stm32f103c8t6_demo/user/main.c
//单片机头文件
#include "stm32f10x.h"

//网络协议层
#include "onenet.h"

//网络设备
#include "esp8266.h"

//硬件驱动
#include "delay.h"
#include "usart.h"
#include "led.h"
#include "key.h"
#include "dht11.h"

//C库
#include <string.h>

#define ESP8266_ONENET_INFO		"AT+CIPSTART=\"TCP\",\"192.168.137.38\",1883\r\n"

void Hardware_Init(void)
{
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);	//中断控制器分组设置

	Delay_Init();									//systick初始化
	
	Usart1_Init(115200);							//串口1，打印信息用
	
	Usart2_Init(115200);							//串口2，驱动ESP8266用
	
  Key_Init();
	
	Led_Init();									//蜂鸣器初始化
	
//	while(DHT11_Init())
//	{
//		UsartPrintf(USART_DEBUG, "DHT11 Error \r\n");
//		DelayMs(1000);
//	}
	
	UsartPrintf(USART_DEBUG, " Hardware init OK\r\n");
	
}

/*
************************************************************
*	函数名称：	main
*
*	函数功能：	
*
*	入口参数：	无
*
*	返回参数：	0
*
*	说明：		
************************************************************
*/
u8 temp;
u8 humi;
int main(void)
{
	
	unsigned short timeCount = 0;	//发送间隔变量
	
	unsigned char *dataPtr = NULL;
	
	Hardware_Init();				//初始化外围硬件
	
	ESP8266_Init();					//初始化ESP8266

	
	UsartPrintf(USART_DEBUG, "Connect MQTTs Server...\r\n");
	while(ESP8266_SendCmd("AT+MQTTUSERCFG=0,1,\"STM32\",\"admin\",\"public\",0,0,\"\"\r\n", "OK"))
		DelayXms(500);
	UsartPrintf(USART_DEBUG, "MQTT INIT ...\r\n");
	while(ESP8266_SendCmd("AT+MQTTCONN=0,\"192.168.137.38\",1883,1\r\n", "CONNECTED"))
		DelayXms(500);
	UsartPrintf(USART_DEBUG, "Connect MQTT Server Success\r\n");

	
	while(1)
	{
//		DHT11_Read_Data(&temp,&humi);//
//		UsartPrintf(USART_DEBUG, "P4****temp %d ,humi %d\r\n",temp,humi);
		
//		if(++timeCount >= 500)									//发送间隔5s
//		{
////			SHT20_GetValue();
//			
//			UsartPrintf(USART_DEBUG, "OneNet_SendData\r\n");
//			OneNet_SendData();									//发送数据
//			
//			timeCount = 0;
//			ESP8266_Clear();
//		}
//		
//		dataPtr = ESP8266_GetIPD(0);
//		if(dataPtr != NULL)
//			OneNet_RevPro(dataPtr);
		DelayMs(10);
	
	}

}
